
'ヘッダーファイル概要テンプレート作成マクロ
'    Copyright hokamoto
'    マクロテンプレ
'    x = ""&vbCrLf 
'    x = x &""&vbCrLf

'変数宣言
Dim x
Dim y
Dim z
Dim name
Dim fname
Dim ary


Set objFSO = CreateObject("Scripting.FileSystemObject")
Set objFile = objFSO.GetFile(GetFileName)

fname = objFile.Name		'ファイル名げっと
name = UCase(fname)		'おおもじ

ary = Split(name, ".")
name = "_" & ary(0) & "_" & ary(1) & "_"		'インクルードガード名作成


'日付取得
y = ExpandParameter("$d")

z = Chr(34)		' "(ダブルクォーテーション)をzに設定

x =    "#ifndef " & name & vbCrLf
x = x &"#define " & name & vbCrLf
x = x &"#ifdef __cplusplus"&vbCrLf
x = x &"extern "
x = x & z & "C" & z & " {	/* } */"&vbCrLf
x = x &"#endif"&vbCrLf
x = x &"/*******************************************************************************"&vbCrLf
x = x &"*	Author		|	Date		|	FileName"&vbCrLf
x = x &"*-------------------------------------------------------------------------------"&vbCrLf
x = x &"*	ken_chaan	|	" & y & "	|	" & fname & vbCrLf
x = x &"*-------------------------------------------------------------------------------"&vbCrLf
x = x &"*	Description	|	" & vbCrLf
x = x &"*-------------------------------------------------------------------------------"&vbCrLf
x = x &"*	Copyright (c) " & Year( Now ) & " ken_chaan All Rights Reserved." & vbCrLf
x = x &"*******************************************************************************/"&vbCrLf
x = x &vbCrLf
x = x &"/*------------------------------------------------------------------------------"&vbCrLf
x = x &"*	include"&vbCrLf
x = x &"*-----------------------------------------------------------------------------*/"&vbCrLf
x = x &vbCrLf
x = x &vbCrLf
x = x &"/*------------------------------------------------------------------------------"&vbCrLf
x = x &"*	define"&vbCrLf
x = x &"*-----------------------------------------------------------------------------*/"&vbCrLf
x = x &vbCrLf
x = x &vbCrLf
x = x &"/*------------------------------------------------------------------------------"&vbCrLf
x = x &"*	macro"&vbCrLf
x = x &"*-----------------------------------------------------------------------------*/"&vbCrLf
x = x &vbCrLf
x = x &vbCrLf
x = x &"/*------------------------------------------------------------------------------"&vbCrLf
x = x &"*	typedef"&vbCrLf
x = x &"*-----------------------------------------------------------------------------*/"&vbCrLf
x = x &vbCrLf
x = x &vbCrLf
x = x &"/*------------------------------------------------------------------------------"&vbCrLf
x = x &"*	enum"&vbCrLf
x = x &"*-----------------------------------------------------------------------------*/"&vbCrLf
x = x &vbCrLf
x = x &vbCrLf
x = x &"/*------------------------------------------------------------------------------"&vbCrLf
x = x &"*	struct"&vbCrLf
x = x &"*-----------------------------------------------------------------------------*/"&vbCrLf
x = x &vbCrLf
x = x &vbCrLf
x = x &"/*------------------------------------------------------------------------------"&vbCrLf
x = x &"*	extern data"&vbCrLf
x = x &"*-----------------------------------------------------------------------------*/"&vbCrLf
x = x &vbCrLf
x = x &vbCrLf
x = x &"/*------------------------------------------------------------------------------"&vbCrLf
x = x &"*	extern function prototype"&vbCrLf
x = x &"*-----------------------------------------------------------------------------*/"&vbCrLf
x = x &vbCrLf
x = x &vbCrLf
x = x &vbCrLf
x = x &"/*------------------------------------------------------------------------------"&vbCrLf
x = x &"*	End Of File"&vbCrLf
x = x &"*-----------------------------------------------------------------------------*/"&vbCrLf
x = x &"#ifdef __cplusplus"&vbCrLf
x = x &"}"&vbCrLf
x = x &"#endif"&vbCrLf
x = x &"#endif	/* " & name & " */" & vbCrLf

'xの表示
Editor.InsText(x)


